HarnessDemo/data/Register.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Register xmlns="http://www.odin.co.uk/webservices">
      <title>%Title%</title>
      <name>%Name%</name>
      <gender>%Gender%</gender>
      <DOB>%DOB%</DOB>
      <email>%Email%</email>
      <receiveInfo>%MailingList%</receiveInfo>
    </Register>
  </soap:Body>
</soap:Envelope>